---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSettings
source: html/f5b24884-b2bc-acfc-2f70-40ad7b938096.htm
---
# StructuralSettings Properties

The id of the assembly instance to which the element belongs.